Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/edc/PIC32MZ2064DAA169.PIC
      <edc:DCRDef edc:_addr="0x1FC2FFD0" edc:access="--------------------------------" edc:cname="UBADEVCP3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="UBADEVCP3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC2FFD4" edc:access="--------------------------------" edc:cname="UBADEVCP2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="UBADEVCP2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC2FFD8" edc:access="--------------------------------" edc:cname="UBADEVCP1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="UBADEVCP1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC2FFDC" edc:access="---n----------------------------" edc:cname="UBADEVCP0" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x10000000" edc:name="UBADEVCP0" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x10000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="28"/>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protect" edc:mask="0x1" edc:name="CP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x80" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC2FFE0" edc:access="--------------------------------" edc:cname="UBADEVSIGN3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="UBADEVSIGN3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC2FFE4" edc:access="--------------------------------" edc:cname="UBADEVSIGN2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="UBADEVSIGN2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC2FFE8" edc:access="--------------------------------" edc:cname="UBADEVSIGN1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="UBADEVSIGN1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC2FFEC" edc:access="--------------------------------" edc:cname="UBADEVSIGN0" edc:default="0x7fffffff" edc:desc="" edc:factorydefault="0x7fffffff" edc:impl="0x0" edc:name="UBADEVSIGN0" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="Sign" edc:ishidden="true" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:desc="Reserved always 0" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC2FFF0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UBASEQ3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:name="UBASEQ3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="TSEQ" edc:desc="Boot Flash True Sequence Number" edc:mask="0xffff" edc:name="TSEQ" edc:nzwidth="16"/>
            <edc:DCRFieldDef edc:cname="CSEQ" edc:desc="Boot Flash Complement Sequence Number" edc:mask="0xffff" edc:name="CSEQ" edc:nzwidth="16"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC2FFF4" edc:access="--------------------------------" edc:cname="UBASEQ2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="UBASEQ2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC2FFF8" edc:access="--------------------------------" edc:cname="UBASEQ1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="UBASEQ1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
